#+TITLE: Plan for Lab Data Service
#+AUTHOR: VLEAD
#+DATE: [2017-10-11 Wed]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  - This document contains the realization plan for
    implementing the Lab Data Service.

* Plan 
** [[https://github.com/vlead/lab-data-service/milestone/8][Milestone one]]
  :PROPERTIES:
  :CUSTOM_ID: plan-for-milestone-one
  :END: 

  This milestone includes the following features:
1) Updating LDS with 178 Labs data 
2) Features/Enhancements:
  a) Add 'Phase' table to the current Schema.
  b) Implementation of 'Migration' Script. 
  c) Implementation of 'Backup' and 'Restore' Scripts. 
  
#+caption:  realization-plan
#+name: tbl-realization-plan
|-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
|    S. | Tasks                    | Github |  Expected | Actual |  Estimated |     Actual | Status | Assignee  |
|    NO |                          | Issues |    Effort | Effort |     Start, |     Start/ |        |           |
|       |                          |        |       (in |    (in |        End |        End |        |           |
|       |                          |        |    person | person |      Dates |      Dates |        |           |
|       |                          |        |    hours) | hours) |            |            |        |           |
|-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
|    1. | Some labs are not        | [[https://github.com/vlead/lab-data-service/issues/92][#92]]    |        60 |     48 | 09-09-2017 | 09-09-2017 | Done   | Sanchita  |
|       | captured in lds database |        |           |        | 13-09-2017 | 13-09-2017 |        | Mrudhvika |
|-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
|    2. | create a new table       | [[https://github.com/vlead/lab-data-service/issues/91][#91]]    |        60 |     24 | 02-10-2017 | 03-10-2017 | Done   | Madhavi   |
|       | 'Phase' in the database  |        |           |        | 06-10-2017 | 06-10-2017 |        |           |
|-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
|    3. | Implementation of        | [[https://github.com/vlead/lab-data-service/issues/95][#95]]    |         8 |      6 | 09-10-2017 | 09-10-2017 | Done   | Madhavi   |
|       | Migration Script         |        |           |        | 09-10-2017 | 09-10-2017 |        |           |
|-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
|    4. | Implementation of        | [[https://github.com/vlead/lab-data-service/issues/96][#96]]    |         8 |      6 | 10-10-2017 | 10-10-2017 | Done   | Madhavi   |
|       | 'Restore' and            |        |           |        | 10-10-2017 | 10-10-2017 |        |           |
|       | 'Backup' Scripts         |        |           |        |            |            |        |           |
|-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
|    5. | Deployment of            | [[https://github.com/vlead/lab-data-service/issues/97][#97]]    |        16 |     12 | 11-10-2017 | 11-10-2017 | Done   | Madhavi   |
|       | 'lab-data-service'       |        |           |        | 12-10-2017 | 12-10-2017 |        |           |
|       | on Testing and           |        |           |        |            |            |        |           |
|       | Staging Environments     |        |           |        |            |            |        |           |
|-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
| Total |                          |        |       153 |     96 |            |            |        |           |
|     ^ |                          |        | estimated | actual |            |            |        |           |
|-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
#+TBLFM: $estimated=vsum(@II+1..@-1)
#+TBLFM: $actual=vsum(@II+1..@-1)

